SYMBOL_NAME_MAP = {
    # ===== 指数 =====
    "SH000001": "上证指数",
    "SZ399001": "深证成指",
    "SZ399006": "创业板指",

    # ===== ETF =====
    "SH510300": "沪深300ETF",
    "SH510500": "中证500ETF",
    "SH512980": "传媒ETF",
    "SH512400": "有色金属ETF",
    "SH515220": "煤炭ETF",
    "SH515790": "光伏ETF",
    "SH515880": "通信ETF",
    "SH516020": "化工ETF",
    "SH518880": "黄金ETF",
    "SH513100": "纳指ETF",
    "SH513090": "香港证券ETF",
    "SH513880": "日经225ETF",
    "SH511090": "30年国债ETF",
    "SH562500": "机器人ETF",
    "SH589010": "科创人工智能ETF",
    "SH588170": "科创半导体ETF",

    "SZ159851": "金融科技ETF",
    "SZ159852": "软件ETF",
    "SZ159739": "云计算ETF",
    "SZ159206": "卫星ETF",
    "SZ159570": "港股通创新药ETF",

    # ===== 个股 =====
    "SH600395": "盘江股份",
    "SH600759": "洲际油气",
    "SH601179": "中国西电",

    "SZ000001": "平安银行",
    "SZ002709": "天赐材料",
    "SZ002716": "湖南白银",
    "SZ002837": "英维克",
    "SZ000888": "峨眉山",
    "SZ300058": "蓝色光标",
    "SZ300604": "长川科技",
    "SZ300617": "安靠智电",
    "SZ300624": "万兴科技",
    "SZ300919": "中伟新材",

    # ===== 通达信特殊指数 =====
    "SH880789": "昨成交20",
    "SH880698": "宽基ETF指数",
}
